var result = "number" + 3 + 3; //Відбувається конкатенація. До строки "number" буде додано цифри 3 та 3. 
 //Цифри не склададаються у даному випадку. 
console.log(result); // результат: number33

var result = null + 3; // null - це пусте значення, нічого не має. Тому, якщо до нічого додати 3 - буде 3.
console.log(result); // результат: 3

var result = 5 && "qwerty"; // && - Логічний оператор "АБО" (OR).Повертає true, якщо обидва операнди є true, інакше повертає false. 
// В данному випадку 5 - це не нульове число, яке відповідає true,  "qwerty" - не пуста строкк, яка також відповідає true. Отже, true && true => true. 
console.log(result); // результат: true

var result = +'40' + +'2' + "hillel"; // Відбувається конкатенація з одночасним складанням 40 та 2 тому, що перед ними стоїть унарний '+'.
console.log(result); // результат: 42hillel

var result = '10' - 5 === 6; //  Застосовується оператор строгої рівності (===). Отримуємо false тому, що ми намагаємось від стрінгу 
// відняти 5 та отримати 6. 
console.log(result); // результат: false

var result = true + false; // логічна одиниця true є 1, false = 0. Тобто, 1+0 = 1.
console.log(result); // результат: 1.

var result =  '4px' - 3 // Від стрінгу, який містить цифру та букви, віднімається 3. Це не має сенсу. Значення Nan не дорівнює нічому
console.log(result); // результат: Nan.

var result = '4' - 3; // У данному випадку,  Javascript приймає стрінг за число та робить віднімання. 
console.log(result); // результат: 1

var result = '6' + 3 ** 0; // ** - це зведення у ступінь. Тут спочатку 3 возводиться у ступінь 0, а потім строка 6 приплюсовує до себе одиницю.
console.log(result); // результат: 61

var result = 12 / '6'; //Відбувається операція поділу.
// Число 12 ділеться на стрінг 6 (стрінг перетворюється у число).
console.log(result); // результат: 2

var result = '10' + (5 === 6); //Конкатенація з одночасною перевіркою на true/false. 
//оператор строгої рівності (===). 5 не дорівнюється 6.
console.log(result); // результат: 10false

var result =  null == '' ; // Оператор рівності (==) - Порівнює два значення на рівність (за значенням), і повертає true, якщо 
//вони рівні, і false - якщо нерівні. у данному випадку '' - це пуста строка, але це не null. 
//Пуста строка може використовуватися у якості пробілу.
console.log(result); // результат: false

var result =  3 ** (9 / 3); // ** - це зведення у ступінь. Тут спочатку 9 ділеться на 3 = 3. Потім 3 возводиться у ступінь 3.
console.log(result); // результат: 27

var result = !!'false' == !!'true'; // "false" відповідає non empty string, а true => double negation true => true.

!!'true' => non empty string => true => double negation true => true

Отже, true == true, тобто результат: true
console.log(result); // результат: true

var result = 0 || '0' && 1 // Пріоритет оператора І && більше, ніж АБО ||, тому він виконується раніше.
// Отже, оператор && обчислює операнди ліворуч праворуч до першого «хибного» і повертає його, а якщо всі справжні – то останнє значення.
// A оператор || обчислює операнди ліворуч праворуч до першого «істинного» і повертає його, а якщо всі помилкові – то останнє значення.
console.log(result); // результат: 1

var result = (+null == false) < 1; // +null - це 0. (+null == false) - це true. True < 1 - це false, тому що логічна одиниця true є 1;
console.log(result); // результат: false

var result = false && true || true // Пріоритет оператора І && більше, ніж АБО ||, тому він виконується раніше. 
// Якщо лівий аргумент – false, оператор І повертає його та закінчує обчислення.
// Інакше – обчислює та повертає правий аргумент.
// false && true = false. false || true = true.
console.log(result); // результат:

var result = false && (false || true); // Тут поперше виповнюється дія у дужках. false || true = true.
// Далі, false && true = false.
console.log(result); // результат: false

var result = (+null == false) < 1 ** 5; // +null - це 0. (+null == false) - це true. 
// True < 1 у п'ятій ступені - це false, тому що логічна одиниця true є 1, а 1 у 5ій ступені =1.;
console.log(result); // результат: false
